Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_CONNECTION_HANDLER_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.RBS_ENERGY_ANALYSIS_MODE
"Analysis Mode"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_DOMAIN_TYPE_PARAM
"Domain Type"

Autodesk.Revit.DB.BuiltInParameter.SHARED_SYMBOL_NAME_PARAM
"Shared Symbol"

Autodesk.Revit.DB.BuiltInParameter.SHARED_SYMBOL_ID_PARAM
"Shared Symbol Id"

Autodesk.Revit.DB.BuiltInParameter.BENT_FABRIC_PARAM_LONGITUDINAL_CUT_LENGTH
"Longitudinal Cut Length": Bend Fabric longitudinal cut length.

Autodesk.Revit.DB.BuiltInParameter.BENT_FABRIC_PARAM_ORIENTATION
"Orientation": Bend fabric wires orientation.